{"id":244,"date":"2024-02-05T09:44:50","date_gmt":"2024-02-05T14:44:50","guid":{"rendered":"https:\/\/www.virlan.co\/game\/?p=244"},"modified":"2024-09-09T19:41:52","modified_gmt":"2024-09-09T23:41:52","slug":"tunnel-rush","status":"publish","type":"post","link":"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/","title":{"rendered":"Tunnel Rush"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">Tunnel Rush Unblocked Games : Play Online in your Browser on PC, Mobile and Tablet devices<\/h2>\n\n\n<p>Tunnel Rush Unblocked is the ultimate 3D single-player experience.<\/p>\n<p>Controls:<\/p>\n<ul>\n<li>Left and right arrow keys \/ A, D &#8211; Move left and right<\/li>\n<li>Space &#8211; Pause \/ restart<\/li>\n<\/ul>\n\n\n<h2 class=\"wp-block-heading\">Play Tunnel Rush Unblocked Game<\/h2>\n\n\n\n<p>Race at break-neck speeds through an ever-changing tunnel packed with all kinds of obstacles.<\/p>\n\n\n<h3>Tunnel Rush unblocked this is a beautiful and crazy game that will test your speed and reaction.<\/h3>\n<p>Use the left and right arrows to bypass moving obstacles in the tunnel. Every time you exceed your record a notice will appear and you will understand that you have become a little cooler.<\/p>\n<p>Blaze your way through caves and tunnels. Each <strong>Tunnel Rush<\/strong> level drops you into a whirling kaleidoscope of hazards and 3D tunnels. Play <span style=\"text-decoration: underline;\"><strong>Tunnel Rush<\/strong><\/span> to dodge barriers using just your wits and your keyboard. In the game, the ball will keep rolling forward, there will be unknown obstacles in front of us, we need to control the ball to get the tunnel!<\/p>\n<p>Just dodge the obstacles by dodging the diamonds in the middle. Now let&#8217;s take the challenge together! Wanna test your reaction speed? Play <strong>Tunnel Rush online<\/strong> now and push your skills to the limit. There’s only one way to show those barriers who’s boss, so <strong>play Tunnel Rush<\/strong> on Poki to show off those ultra-sharp reactions.<\/p>\n<\/p>\n<h3>What is the highest score in Tunnel rush<\/h3>\n<p>Tunnel Rush High Scores<\/p>\n<ul>\n<li>Aaron Noonan. 692.<\/li>\n<li>Dane the Tiger. 464.<\/li>\n<li>Thomas. 373.<\/li>\n<\/ul>\n<p>Use the left and right keyboard arrow keys to rotate the screen clockwise or anti-clockwise &#8211; that’s it! The game is divided into separate levels but there is no save point. Regardless of how many levels you have completed, if you crash, you have to start from the beginning!<\/p>\n<p>This awesome game requires great reflexes and reactions &#8211; you must have fast fingers and stay focused at all times to anticipate the next movements you must take.<\/p>\n<\/p>\n<h3>Is there a tunnel Rush 2<\/h3>\n<p><strong>Tunnel Rush 2<\/strong> is a skill game where you ride fast into colorful 3D tunnels and experience the exhilarating kaleidoscope of hazards and treasures!<\/p>\n<p>Rotate the screen clockwise or anti-clockwise to move your ship and break through the obstacle that matches your ship&#8217;s current color, otherwise your ship will crash. Collect as many diamonds as possible to upgrade your ship.<\/p>\n<p>The obstacles will become harder to pass with each level passed, so keep your focus on the screen and your fingers on the buttons!<\/p>\n<p>Can you finish <span style=\"text-decoration: underline;\"><strong>Tunnel Rush 2<\/strong><\/span> and unlock every upgrade?<\/p>\n<h2>How to play Tunnel Rush 2<\/h2>\n<ul>\n<li>Move &#8211; A\/D or Left\/Right arrow keys<\/li>\n<li>(Mobile) Move &#8211; Tap and hold the left or right side of the screen<\/li>\n<\/ul>\n<h4>Who created tunnel rush<\/h4>\n<h6>Tunnel Rush now has a cool two-player mode.<\/h6>\n<p>Race next to each other in the same screen and see which of you wins the tunnel race!<\/p>\n<blockquote>\n<p>Tunnel Rush is created by British studio Deer Cat Games who have also created a sequel to the game in the form of Tunnel Rush 2. They are also the creator behind Wave Rider and Super-Speeder.<\/p>\n<\/blockquote>\n<h3>TUNNEL RUSH Gameplay<\/h3>\n<h4>Interested in high-speed games? Tunnel Rush will bring you all the feelings you desire!<\/h4>\n<p>It&#8217;s a very fast-paced 1st person flying type where you are continuously having to dodge objects which are stationary at first, but soon begin to move as the levels progress. Also, you&#8217;re speed increases with each new level. The only control is by using your thumbs to either dodge left or right to avoid hitting anything. After every 5 crashes, you do have an ad, but only 5 seconds long! And, once you reach level 76, there are no more ads, but that will take you a while. Cool game!<\/p>\n<h5>Introduction to the Tunnel Rush game<\/h5>\n<p>Great game for passing the time. Comparing your app to some similar apps, I love it how we can play inside the tunnel and outside it. It never gets boring. I love how the colors change and how there are both levels and increasing speed. Would be awesome to add some texture colors instead of\/plus the solid colored environment. Please add some background sky pictures changeable with the level or every 10 levels. Thank you all.<\/p>\n<p>Really fun game! Reminds me of something that may have been in a video arcade back in the &#8217;80s. Great music; begs to be played with headphones! I think it would be nice to add a few options to settings. I think a control option for rotational speed. Maybe it could have a Bluetooth control setting to use with a gamepad? Even better, up the graphics and being it to the Xbox One! I have seen a lot of Android apps show up in the Xbox Store! Okay, maybe there could be a VR headset option where the screen can be split and put into a Google Cardboard or similar headset, just for more 3D effect. Okay, I&#8217;ll stop there, since this is supposed to be a short review. In summary, Great Job Guys!. Oh, I almost forgot, please add a pro option to buy it and remove ads and make the game continuable without any ad watching!<\/p>\n<h5>What You Can Expect in the Game<\/h5>\n<p>If you’re looking for a fun and challenging game to play on your computer, then you should check out the Tunnel Rush game. This free game is perfect for those who love to explore and be creative. With its unique design and easy-to-use controls, Tunnel Rush gives you the opportunity to create stunning 3D designs. And if that’s not enough, there are also challenges waiting for you in the game!<\/p>\n<p>If you love tunnel games, then you’re in for a treat! This free game is perfect for anyone who loves to play on the go. With just a few clicks, you can start playing the Tunnel Rush game. The goal of the game is to guide the three friends through a series of Maze-like levels. As they progress, the maze gets more difficult and the obstacles get closer. To make things even more challenging, each level features a new enemy that must be avoided. Don’t miss out on this free game and see how high you can climb!<\/p>\n<h5>Challenges waiting for you in the game.<\/h5>\n<p>If you’re looking for a new and exciting game to play on your computer, then the Tunnel Rush game is perfect for you! This game is very simple to play, but it’s definitely hard as hell. The objective of the game is to run through the tunnel as fast as possible. You can also play it with a friend or online against others.<\/p>\n<\/p>\n<h3>Best Games like Tunnel Rush<\/h3>\n<p>This is a hugely popular game and CrazyGames feature a myriad of similar titles that are just as popular. The following are some other fun avoid games:<\/p>\n<h4>Infinite Tunnel Rush 3D<\/h4>\n<h6>playing same type of infinite running games<\/h6>\n<p>But still want a fun filled game?<\/p>\n<p>A physics based simulation game which defies geometry. As a surfer you need to survive through the infinitely changing direction. Pass through the tricky obstacles which can be static as well as dynamic. Obstacles may be sphere shape, cubical or triangular. You will need to be fast to change your strategy according to the pace of the game.<\/p>\n<\/p>\n<h4><span style=\"color: #00ccff;\"><a style=\"color: #00ccff;\" href=\"https:\/\/www.virlan.co\/game\/crazy-roll-3d\/\">Crazy Roll 3D<\/a><\/span><\/h4>\n<p>Crazy Roll 3D is an endless <strong>ball maze game<\/strong> which is equally exciting and epic.<\/p>\n<h5>Subway Surf<\/h5>\n<p>Subway Surfers is a classic <strong>endless runner game<\/strong>. You play as Jake, who surfs the subways and tries to escape from the grumpy Inspector and his dog. You&#8217;ll need to dodge trains, trams, obstacles, and more to go as far as you can in this endless running game.<\/p>\n<\/p>\n<h5>Angry Gran Run: Miami<\/h5>\n<p>Try to get as far as possible. Jump around, run around and dodge all the incoming obstacles in this original game. Welcome to Miami, where you have to reach the finish line unharmed. It&#8217;ll be no easy task, so get to it and show everyone that granny always wins. There&#8217;s work ahead of you, so be focused and dodge all the obstacles!<\/p>\n<\/p>\n<h4>Endless Runner Games<\/h4>\n<p>Endless runners are games are adventure platform games that can go on forever. Run through forests, cities, skies, and mountains and try to get as far as you can each time. You may be running away from monsters or you may need to avoid obstacles along the way as you run nowhere and everywhere in these exhilarating runner games.<\/p>\n<h4>SpeedX 3D<\/h4>\n<p>SpeedX 3D is an Arcade and Single-player video game created by Gamelion Studios. The game acts as the remastered version of the original game, and it comes with several modifications and improvements. It offers fully challenging, gorgeous, exciting and entertaining gameplay. There are over fifty challenging levels, and the player can compete against other players in Online Multiplayer mode. The main objective of the player is to score the best points and then struggle to break down his own records in endless Survival mode.<\/p>\n<h4>Hop<\/h4>\n<p>Hop is an Arcade and Single-player video game for mobile devices such as Android and iOS by Ketchapp. The game comes with an exciting gameplay revolving around the bouncing ball controlled by the player throughout several levels. The main objective of the player is to bounce the ball off the tiles and struggle to make as many hops as possible in the mind-blowing action gameplay. Using the touch screen the player can drag his finger right or left to command the ball from platform to platform.<\/p>\n<h4>Rotator<\/h4>\n<p>Rotator is an Arcade and Single-player video game developed and published by Ketchapp for Android and iOS. The game is set in the tunnel-type environment where the player controls the ball from a third-person perspective with the aim to go as far as possible while making the best points by collecting as many coins as possible.<\/p>\n<h4>Paint Hit<\/h4>\n<p>Paint Hit is an Arcade and Single-player video game by Mag Interactive for Android and iOS. The game lets the player experience an addictive and one finger control gameplay with beautiful art-style. It starts with the player slashing his drops of colour on the 3D tower and struggle to paint it all the way. In the game, the player will not stop until he splats all the way to the top. There are over 100 exciting levels, and the main goal of the player is to score the best points to challenge the bosses.<\/p>\n<h4>Color Road<\/h4>\n<p>Color Road is an Arcade and Single-player video game created and published by VooDoo for Android and iOS. The game is set in the fantastic environment where the player controls a ball from a third-person perspective with an aim to roll the ball which has the same colour. During the game, the player needs to avoid obstacles and the ball which has a different colour.<\/p>\n<h4>Helix Jump<\/h4>\n<p>Helix Jump is an Action, Endless Gameplay, and Single-player video game developed and published by Voodoo for mobile devices such as Android, iOS and Windows Phone. The game sets out the player on an exciting adventure of the bouncing ball through the tower labyrinth. It offers the One finger controls and enables the player to cover the distance as long as possible to score the best points.<\/p>\n<\/p>\n\n\n<div class=\"schema-faq wp-block-yoast-faq-block\"><div class=\"schema-faq-section\" id=\"faq-question-1647174397963\"><strong class=\"schema-faq-question\">When was Tunnel Rush made?<\/strong> <p class=\"schema-faq-answer\">Tunnel Rush was a Macromedia Flash Toonami game that was created for the second Toonami Mobile Game Unit tour in 2003.<\/p> <\/div> <div class=\"schema-faq-section\" id=\"faq-question-1647174560748\"><strong class=\"schema-faq-question\">Is Rush a two player game?<\/strong> <p class=\"schema-faq-answer\">Rush supports two-player split-screen co-op in both the park and all movie-themed levels.<\/p> <\/div> <\/div>\n","protected":false},"excerpt":{"rendered":"<p>Tunnel Rush Unblocked Games : Play Online in your Browser on PC, Mobile and Tablet devices Tunnel Rush Unblocked is the ultimate 3D single-player experience. Controls: Left and right arrow keys \/ A, D &#8211; Move left and right Space&#8230; <\/p>\n","protected":false},"author":1,"featured_media":4555,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[9197,1],"tags":[27,958,947,8662,929,2724],"class_list":["post-244","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-ball-running-games","category-best-unblocked-games","tag-cool-math-games","tag-goguardian","tag-shs-games","tag-tunnel-rush-2","tag-tunnel-rush-zeph","tag-unblocked-games-66-zz"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v23.5 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Tunnel Rush<\/title>\n<meta name=\"description\" content=\"Play Tunnel Rush Unblocked Games : Play online in browser, PC. Best endless runner game. playing same type of running games\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Tunnel Rush\" \/>\n<meta property=\"og:description\" content=\"Play Tunnel Rush Unblocked Games : Play online in browser, PC. Best endless runner game. playing same type of running games\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/\" \/>\n<meta property=\"og:site_name\" content=\"Unblocked Games\" \/>\n<meta property=\"article:published_time\" content=\"2024-02-05T14:44:50+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-09-09T23:41:52+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.virlan.co\/unblocked-games\/wp-content\/uploads\/2024\/02\/Tunnel-Rush.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"250\" \/>\n\t<meta property=\"og:image:height\" content=\"250\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Smith\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Smith\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/\"},\"author\":{\"name\":\"Smith\",\"@id\":\"https:\/\/www.virlan.co\/unblocked-games\/#\/schema\/person\/d6003e51b387aef07a0a8d6c24fb0150\"},\"headline\":\"Tunnel Rush\",\"datePublished\":\"2024-02-05T14:44:50+00:00\",\"dateModified\":\"2024-09-09T23:41:52+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/\"},\"wordCount\":1925,\"publisher\":{\"@id\":\"https:\/\/www.virlan.co\/unblocked-games\/#\/schema\/person\/d6003e51b387aef07a0a8d6c24fb0150\"},\"image\":{\"@id\":\"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.virlan.co\/unblocked-games\/wp-content\/uploads\/2024\/02\/Tunnel-Rush.jpg\",\"keywords\":[\"cool math games\",\"goguardian\",\"SHS Games\",\"tunnel rush 2\",\"tunnel rush zeph\",\"Unblocked Games 66 ZZ\"],\"articleSection\":[\"Ball Running Games\",\"Best Games\"],\"inLanguage\":\"en-US\"},{\"@type\":[\"WebPage\",\"FAQPage\"],\"@id\":\"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/\",\"url\":\"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/\",\"name\":\"Tunnel Rush\",\"isPartOf\":{\"@id\":\"https:\/\/www.virlan.co\/unblocked-games\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.virlan.co\/unblocked-games\/wp-content\/uploads\/2024\/02\/Tunnel-Rush.jpg\",\"datePublished\":\"2024-02-05T14:44:50+00:00\",\"dateModified\":\"2024-09-09T23:41:52+00:00\",\"description\":\"Play Tunnel Rush Unblocked Games : Play online in browser, PC. Best endless runner game. playing same type of running games\",\"breadcrumb\":{\"@id\":\"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/#breadcrumb\"},\"mainEntity\":[{\"@id\":\"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/#faq-question-1647174397963\"},{\"@id\":\"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/#faq-question-1647174560748\"}],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/#primaryimage\",\"url\":\"https:\/\/www.virlan.co\/unblocked-games\/wp-content\/uploads\/2024\/02\/Tunnel-Rush.jpg\",\"contentUrl\":\"https:\/\/www.virlan.co\/unblocked-games\/wp-content\/uploads\/2024\/02\/Tunnel-Rush.jpg\",\"width\":250,\"height\":250,\"caption\":\"Tunnel Rush\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.virlan.co\/unblocked-games\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Tunnel Rush\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.virlan.co\/unblocked-games\/#website\",\"url\":\"https:\/\/www.virlan.co\/unblocked-games\/\",\"name\":\"Free Online Games\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/www.virlan.co\/unblocked-games\/#\/schema\/person\/d6003e51b387aef07a0a8d6c24fb0150\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.virlan.co\/unblocked-games\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":[\"Person\",\"Organization\"],\"@id\":\"https:\/\/www.virlan.co\/unblocked-games\/#\/schema\/person\/d6003e51b387aef07a0a8d6c24fb0150\",\"name\":\"Smith\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.virlan.co\/unblocked-games\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/www.virlan.co\/unblocked-games\/wp-content\/uploads\/2022\/02\/VIRLAN.jpg\",\"contentUrl\":\"https:\/\/www.virlan.co\/unblocked-games\/wp-content\/uploads\/2022\/02\/VIRLAN.jpg\",\"width\":200,\"height\":200,\"caption\":\"Smith\"},\"logo\":{\"@id\":\"https:\/\/www.virlan.co\/unblocked-games\/#\/schema\/person\/image\/\"},\"url\":\"https:\/\/www.virlan.co\/unblocked-games\/author\/gmvmafvigoun11\/\"},{\"@type\":\"Question\",\"@id\":\"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/#faq-question-1647174397963\",\"position\":1,\"url\":\"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/#faq-question-1647174397963\",\"name\":\"When was Tunnel Rush made?\",\"answerCount\":1,\"acceptedAnswer\":{\"@type\":\"Answer\",\"text\":\"Tunnel Rush was a Macromedia Flash Toonami game that was created for the second Toonami Mobile Game Unit tour in 2003.\",\"inLanguage\":\"en-US\"},\"inLanguage\":\"en-US\"},{\"@type\":\"Question\",\"@id\":\"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/#faq-question-1647174560748\",\"position\":2,\"url\":\"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/#faq-question-1647174560748\",\"name\":\"Is Rush a two player game?\",\"answerCount\":1,\"acceptedAnswer\":{\"@type\":\"Answer\",\"text\":\"Rush supports two-player split-screen co-op in both the park and all movie-themed levels.\",\"inLanguage\":\"en-US\"},\"inLanguage\":\"en-US\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Tunnel Rush","description":"Play Tunnel Rush Unblocked Games : Play online in browser, PC. Best endless runner game. playing same type of running games","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/","og_locale":"en_US","og_type":"article","og_title":"Tunnel Rush","og_description":"Play Tunnel Rush Unblocked Games : Play online in browser, PC. Best endless runner game. playing same type of running games","og_url":"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/","og_site_name":"Unblocked Games","article_published_time":"2024-02-05T14:44:50+00:00","article_modified_time":"2024-09-09T23:41:52+00:00","og_image":[{"width":250,"height":250,"url":"https:\/\/www.virlan.co\/unblocked-games\/wp-content\/uploads\/2024\/02\/Tunnel-Rush.jpg","type":"image\/jpeg"}],"author":"Smith","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Smith","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/#article","isPartOf":{"@id":"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/"},"author":{"name":"Smith","@id":"https:\/\/www.virlan.co\/unblocked-games\/#\/schema\/person\/d6003e51b387aef07a0a8d6c24fb0150"},"headline":"Tunnel Rush","datePublished":"2024-02-05T14:44:50+00:00","dateModified":"2024-09-09T23:41:52+00:00","mainEntityOfPage":{"@id":"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/"},"wordCount":1925,"publisher":{"@id":"https:\/\/www.virlan.co\/unblocked-games\/#\/schema\/person\/d6003e51b387aef07a0a8d6c24fb0150"},"image":{"@id":"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/#primaryimage"},"thumbnailUrl":"https:\/\/www.virlan.co\/unblocked-games\/wp-content\/uploads\/2024\/02\/Tunnel-Rush.jpg","keywords":["cool math games","goguardian","SHS Games","tunnel rush 2","tunnel rush zeph","Unblocked Games 66 ZZ"],"articleSection":["Ball Running Games","Best Games"],"inLanguage":"en-US"},{"@type":["WebPage","FAQPage"],"@id":"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/","url":"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/","name":"Tunnel Rush","isPartOf":{"@id":"https:\/\/www.virlan.co\/unblocked-games\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/#primaryimage"},"image":{"@id":"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/#primaryimage"},"thumbnailUrl":"https:\/\/www.virlan.co\/unblocked-games\/wp-content\/uploads\/2024\/02\/Tunnel-Rush.jpg","datePublished":"2024-02-05T14:44:50+00:00","dateModified":"2024-09-09T23:41:52+00:00","description":"Play Tunnel Rush Unblocked Games : Play online in browser, PC. Best endless runner game. playing same type of running games","breadcrumb":{"@id":"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/#breadcrumb"},"mainEntity":[{"@id":"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/#faq-question-1647174397963"},{"@id":"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/#faq-question-1647174560748"}],"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/#primaryimage","url":"https:\/\/www.virlan.co\/unblocked-games\/wp-content\/uploads\/2024\/02\/Tunnel-Rush.jpg","contentUrl":"https:\/\/www.virlan.co\/unblocked-games\/wp-content\/uploads\/2024\/02\/Tunnel-Rush.jpg","width":250,"height":250,"caption":"Tunnel Rush"},{"@type":"BreadcrumbList","@id":"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.virlan.co\/unblocked-games\/"},{"@type":"ListItem","position":2,"name":"Tunnel Rush"}]},{"@type":"WebSite","@id":"https:\/\/www.virlan.co\/unblocked-games\/#website","url":"https:\/\/www.virlan.co\/unblocked-games\/","name":"Free Online Games","description":"","publisher":{"@id":"https:\/\/www.virlan.co\/unblocked-games\/#\/schema\/person\/d6003e51b387aef07a0a8d6c24fb0150"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.virlan.co\/unblocked-games\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":["Person","Organization"],"@id":"https:\/\/www.virlan.co\/unblocked-games\/#\/schema\/person\/d6003e51b387aef07a0a8d6c24fb0150","name":"Smith","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.virlan.co\/unblocked-games\/#\/schema\/person\/image\/","url":"https:\/\/www.virlan.co\/unblocked-games\/wp-content\/uploads\/2022\/02\/VIRLAN.jpg","contentUrl":"https:\/\/www.virlan.co\/unblocked-games\/wp-content\/uploads\/2022\/02\/VIRLAN.jpg","width":200,"height":200,"caption":"Smith"},"logo":{"@id":"https:\/\/www.virlan.co\/unblocked-games\/#\/schema\/person\/image\/"},"url":"https:\/\/www.virlan.co\/unblocked-games\/author\/gmvmafvigoun11\/"},{"@type":"Question","@id":"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/#faq-question-1647174397963","position":1,"url":"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/#faq-question-1647174397963","name":"When was Tunnel Rush made?","answerCount":1,"acceptedAnswer":{"@type":"Answer","text":"Tunnel Rush was a Macromedia Flash Toonami game that was created for the second Toonami Mobile Game Unit tour in 2003.","inLanguage":"en-US"},"inLanguage":"en-US"},{"@type":"Question","@id":"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/#faq-question-1647174560748","position":2,"url":"https:\/\/www.virlan.co\/unblocked-games\/tunnel-rush\/#faq-question-1647174560748","name":"Is Rush a two player game?","answerCount":1,"acceptedAnswer":{"@type":"Answer","text":"Rush supports two-player split-screen co-op in both the park and all movie-themed levels.","inLanguage":"en-US"},"inLanguage":"en-US"}]}},"_links":{"self":[{"href":"https:\/\/www.virlan.co\/unblocked-games\/wp-json\/wp\/v2\/posts\/244"}],"collection":[{"href":"https:\/\/www.virlan.co\/unblocked-games\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.virlan.co\/unblocked-games\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.virlan.co\/unblocked-games\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.virlan.co\/unblocked-games\/wp-json\/wp\/v2\/comments?post=244"}],"version-history":[{"count":4,"href":"https:\/\/www.virlan.co\/unblocked-games\/wp-json\/wp\/v2\/posts\/244\/revisions"}],"predecessor-version":[{"id":4557,"href":"https:\/\/www.virlan.co\/unblocked-games\/wp-json\/wp\/v2\/posts\/244\/revisions\/4557"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.virlan.co\/unblocked-games\/wp-json\/wp\/v2\/media\/4555"}],"wp:attachment":[{"href":"https:\/\/www.virlan.co\/unblocked-games\/wp-json\/wp\/v2\/media?parent=244"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.virlan.co\/unblocked-games\/wp-json\/wp\/v2\/categories?post=244"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.virlan.co\/unblocked-games\/wp-json\/wp\/v2\/tags?post=244"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}